# MERGING INSTACART DATA

### This script contains the following:
#### 1. Importing libraries
#### 2. Importing data
#### 3. Merging data
#### 4. Exporting data

# --------------------------------------------------------------------------------------------------------------

## 1. Importing libraries

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os

## 2. Importing data

In [3]:
# We create a path to add a shortcut to our files location
path = r'C:\Users\javis\OneDrive\Documentos\Career Foundry\Data Immersion\Python\Instacart Basket Analysis'

In [4]:
# We then give Python the instruction of reading the file located in that path
df_ords = pd.read_csv(os.path.join(path, '2. Data', '2.2. Prepared Data', 'orders_checked.csv'), index_col = False)
df_ords_prior = pd.read_csv(os.path.join(path, '2. Data', '2.1. Original Data', 'order_products__prior.csv'), index_col = False)

## 3. Merging data

In [5]:
# We check the dimensions of our newly imported dataframe
df_ords_prior.shape

(32434489, 4)

In [6]:
# Check the dataframe has no apparent issues
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
# Check the other df
df_ords.shape

(3421083, 9)

In [8]:
# Check its appearance
df_ords.head()

,Unnamed: 0,Unnamed: 0.1,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_from_last_order,first_order
0,0,0,2539329,1,1,2,8,NaN,True
1,1,1,2398795,1,2,3,7,15.0,False
2,2,2,473747,1,3,3,12,21.0,False
3,3,3,2254736,1,4,4,7,29.0,False
4,4,4,431534,1,5,4,15,28.0,False

In [9]:
# Get rid of the first two columns, not representing anything
df_ords = df_ords.drop (columns = ['Unnamed: 0', 'Unnamed: 0.1'])

In [10]:
# Check dimensions again
df_ords.shape

(3421083, 7)

In [11]:
# We then combine both data sets
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [12]:
# Check the output
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_from_last_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [14]:
# We sum up the values to see if they are present in both dataframes or just one
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

## 4. Exporting data

In [15]:
# Export to pickle
df_merged_large.to_pickle(os.path.join(path, '2. Data','2.2. Prepared Data', 'orders_products_combined.pkl'))

In [17]:
# Check the appearance
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_from_last_order,first_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [16]:
df_merged_large.shape

(32434489, 11)